In [1]:
# pandas course - started 2021/01/23 - 1:49 PM, objective is to complete this by the EOD

In [2]:
# pandas is the most popular Python library for data analysis

In [3]:
# importing pandas
import pandas as pd

In [4]:
# two core objects datframes and Series

In [5]:
#DataFrame is a table, it contains an array of individual entries, each of which has a certain value, each entry corrsonds with  arow (or records) an a column

In [6]:
pd.DataFrame({'Yes': [50,21], 'No':[131,2]})

   Yes   No
0   50  131
1   21    2

In [8]:
# entries can be strings
pd.DataFrame({'Yes': ['Alice','Stacy'], 'No':['Abraham','Lisa']})

     Yes       No
0  Alice  Abraham
1  Stacy     Lisa

In [9]:
# in the example aboves, the entry is a dictionay with the keys as the colums as the column name and the values as the rows
# the example above has the idnex as 0,1...
# you can change it by the argument index
pd.DataFrame({'Yes': ['Alice','Stacy'], 'No':['Abraham','Lisa']}, index=[12,12])

      Yes       No
12  Alice  Abraham
12  Stacy     Lisa

In [10]:
# you can also make it look better by indenting properly
pd.DataFrame({'Yes': ['Alice','Stacy'], 
              'No':['Abraham','Lisa']}, 
             index=[12,12])

      Yes       No
12  Alice  Abraham
12  Stacy     Lisa

In [11]:
# Series - by contrast is a seqence of data values, If a DataFrame is a table, a Series is a list
# can be easily created with a list
pd.Series([1,2,'fast','and','furios'])

0         1
1         2
2      fast
3       and
4    furios
dtype: object

In [42]:
# giving names to indexes
seers = pd.Series([11,21,3,3,41,4,5,51,4], name='one')

In [43]:
pd.DataFrame(seers)

   one
0   11
1   21
2    3
3    3
4   41
5    4
6    5
7   51
8    4

In [22]:
pd.Series(['test','of','the','people','of', 1])

0      test
1        of
2       the
3    people
4        of
5         1
dtype: object

In [26]:
list1 = [i for i in range(20)]
pd.Series(list1,index= [i**3 for i in range(20)], name = 'Series3' )

0        0
1        1
8        2
27       3
64       4
125      5
216      6
343      7
512      8
729      9
1000    10
1331    11
1728    12
2197    13
2744    14
3375    15
4096    16
4913    17
5832    18
6859    19
Name: Series3, dtype: int64

In [28]:
win_reviews = pd.read_csv("toy_dataset/toy_dataset.csv")
win_reviews.shape

(150000, 6)

In [29]:
win_reviews.head()

   Number    City Gender  Age   Income Illness
0       1  Dallas   Male   41  40367.0      No
1       2  Dallas   Male   54  45084.0      No
2       3  Dallas   Male   42  52483.0      No
3       4  Dallas   Male   40  40941.0      No
4       5  Dallas   Male   46  50289.0      No

In [32]:
win_reviews.tail()

        Number    City  Gender  Age    Income Illness
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

In [33]:
win_reviews = pd.read_csv("toy_dataset/toy_dataset.csv", index_col=0)
win_reviews

          City  Gender  Age    Income Illness
Number
1       Dallas    Male   41   40367.0      No
2       Dallas    Male   54   45084.0      No
3       Dallas    Male   42   52483.0      No
4       Dallas    Male   40   40941.0      No
5       Dallas    Male   46   50289.0      No
...        ...     ...  ...       ...     ...
149996  Austin    Male   48   93669.0      No
149997  Austin    Male   25   96748.0      No
149998  Austin    Male   26  111885.0      No
149999  Austin    Male   25  111878.0      No
150000  Austin  Female   37   87251.0      No

[150000 rows x 5 columns]

In [45]:
df = pd.read_csv("toy_dataset/toy_dataset.csv", index_col=0)
df

          City  Gender  Age    Income Illness
Number
1       Dallas    Male   41   40367.0      No
2       Dallas    Male   54   45084.0      No
3       Dallas    Male   42   52483.0      No
4       Dallas    Male   40   40941.0      No
5       Dallas    Male   46   50289.0      No
...        ...     ...  ...       ...     ...
149996  Austin    Male   48   93669.0      No
149997  Austin    Male   25   96748.0      No
149998  Austin    Male   26  111885.0      No
149999  Austin    Male   25  111878.0      No
150000  Austin  Female   37   87251.0      No

[150000 rows x 5 columns]

In [49]:
df.Gender.shape

(150000,)

In [60]:
df['City']

Number
1         Dallas
2         Dallas
3         Dallas
4         Dallas
5         Dallas
           ...
149996    Austin
149997    Austin
149998    Austin
149999    Austin
150000    Austin
Name: City, Length: 150000, dtype: object

In [104]:
df[2]

KeyError: 2

In [63]:
df.City[5]

'Dallas'

In [64]:
df['City'][12]

'Dallas'

In [66]:
df.iloc[0]

City       Dallas
Gender       Male
Age            41
Income      40367
Illness        No
Name: 1, dtype: object

In [69]:
pd.read_csv("toy_dataset/toy_dataset.csv")

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [83]:
df = pd.read_csv("toy_dataset/toy_dataset.csv")
df

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [119]:
df[:10]

   Number    City  Gender  Age   Income Illness
0       1  Dallas    Male   41  40367.0      No
1       2  Dallas    Male   54  45084.0      No
2       3  Dallas    Male   42  52483.0      No
3       4  Dallas    Male   40  40941.0      No
4       5  Dallas    Male   46  50289.0      No
5       6  Dallas  Female   36  50786.0      No
6       7  Dallas  Female   32  33155.0      No
7       8  Dallas    Male   39  30914.0      No
8       9  Dallas    Male   51  68667.0      No
9      10  Dallas  Female   30  50082.0      No

In [85]:
df.shape

(150000, 6)

In [120]:
df.iloc[:10]

   Number    City  Gender  Age   Income Illness
0       1  Dallas    Male   41  40367.0      No
1       2  Dallas    Male   54  45084.0      No
2       3  Dallas    Male   42  52483.0      No
3       4  Dallas    Male   40  40941.0      No
4       5  Dallas    Male   46  50289.0      No
5       6  Dallas  Female   36  50786.0      No
6       7  Dallas  Female   32  33155.0      No
7       8  Dallas    Male   39  30914.0      No
8       9  Dallas    Male   51  68667.0      No
9      10  Dallas  Female   30  50082.0      No

In [121]:
df.iloc[10]

Number         11
City       Dallas
Gender     Female
Age            48
Income      41524
Illness       Yes
Name: 10, dtype: object

In [144]:
df.iloc[:10]['City']

0    Dallas
1    Dallas
2    Dallas
3    Dallas
4    Dallas
5    Dallas
6    Dallas
7    Dallas
8    Dallas
9    Dallas
Name: City, dtype: object

In [164]:
df.loc[-5:,'City':'Income']

          City  Gender  Age    Income
0       Dallas    Male   41   40367.0
1       Dallas    Male   54   45084.0
2       Dallas    Male   42   52483.0
3       Dallas    Male   40   40941.0
4       Dallas    Male   46   50289.0
...        ...     ...  ...       ...
149995  Austin    Male   48   93669.0
149996  Austin    Male   25   96748.0
149997  Austin    Male   26  111885.0
149998  Austin    Male   25  111878.0
149999  Austin  Female   37   87251.0

[150000 rows x 4 columns]

In [165]:
df

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [170]:
df.set_index("hey")
df

TypeError: 'str' object is not callable

In [184]:
df = pd.read_csv("toy_dataset/toy_dataset.csv")
df

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [185]:
df.set_index('Number')

          City  Gender  Age    Income Illness
Number
1       Dallas    Male   41   40367.0      No
2       Dallas    Male   54   45084.0      No
3       Dallas    Male   42   52483.0      No
4       Dallas    Male   40   40941.0      No
5       Dallas    Male   46   50289.0      No
...        ...     ...  ...       ...     ...
149996  Austin    Male   48   93669.0      No
149997  Austin    Male   25   96748.0      No
149998  Austin    Male   26  111885.0      No
149999  Austin    Male   25  111878.0      No
150000  Austin  Female   37   87251.0      No

[150000 rows x 5 columns]

In [177]:
df.set_index('Income')

          Number    City  Gender  Age Illness
Income
40367.0        1  Dallas    Male   41      No
45084.0        2  Dallas    Male   54      No
52483.0        3  Dallas    Male   42      No
40941.0        4  Dallas    Male   40      No
50289.0        5  Dallas    Male   46      No
...          ...     ...     ...  ...     ...
93669.0   149996  Austin    Male   48      No
96748.0   149997  Austin    Male   25      No
111885.0  149998  Austin    Male   26      No
111878.0  149999  Austin    Male   25      No
87251.0   150000  Austin  Female   37      No

[150000 rows x 5 columns]

In [194]:
df = pd.read_csv("toy_dataset/toy_dataset.csv")
df1 = df.set_index('Number')
df1

          City  Gender  Age    Income Illness
Number
1       Dallas    Male   41   40367.0      No
2       Dallas    Male   54   45084.0      No
3       Dallas    Male   42   52483.0      No
4       Dallas    Male   40   40941.0      No
5       Dallas    Male   46   50289.0      No
...        ...     ...  ...       ...     ...
149996  Austin    Male   48   93669.0      No
149997  Austin    Male   25   96748.0      No
149998  Austin    Male   26  111885.0      No
149999  Austin    Male   25  111878.0      No
150000  Austin  Female   37   87251.0      No

[150000 rows x 5 columns]

In [195]:
df

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [193]:
# removing the default and naming it using of the columns names - the column should havea all unique values
df1 = df.set_index('Number')
df1

KeyError: "None of ['Number'] are in the columns"

In [244]:
df = pd.read_csv("toy_dataset/toy_dataset.csv")
df

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[150000 rows x 6 columns]

In [245]:
df.loc[(df['Income'] == 40367.0) | (df['City'].isin(['Dallas','Austin']))]

        Number    City  Gender  Age    Income Illness
0            1  Dallas    Male   41   40367.0      No
1            2  Dallas    Male   54   45084.0      No
2            3  Dallas    Male   42   52483.0      No
3            4  Dallas    Male   40   40941.0      No
4            5  Dallas    Male   46   50289.0      No
...        ...     ...     ...  ...       ...     ...
149995  149996  Austin    Male   48   93669.0      No
149996  149997  Austin    Male   25   96748.0      No
149997  149998  Austin    Male   26  111885.0      No
149998  149999  Austin    Male   25  111878.0      No
149999  150000  Austin  Female   37   87251.0      No

[31999 rows x 6 columns]

In [247]:
df['City']

0         Dallas
1         Dallas
2         Dallas
3         Dallas
4         Dallas
           ...
149995    Austin
149996    Austin
149997    Austin
149998    Austin
149999    Austin
Name: City, Length: 150000, dtype: object

In [255]:
df.loc[df['Income'].between(40367.0,93669.0), 'Income'] = 50000
df

        Number  City  Gender  Age    Income Illness
0            1     1    Male   41   50000.0      No
1            2     1    Male   54   50000.0      No
2            3     1    Male   42   50000.0      No
3            4     1    Male   40   50000.0      No
4            5     1    Male   46   50000.0      No
...        ...   ...     ...  ...       ...     ...
149995  149996     1    Male   48   50000.0      No
149996  149997     1    Male   25   96748.0      No
149997  149998     1    Male   26  111885.0      No
149998  149999     1    Male   25  111878.0      No
149999  150000     1  Female   37   50000.0      No

[150000 rows x 6 columns]

In [253]:
df['City'] = 1
df

        Number  City  Gender  Age    Income Illness
0            1     1    Male   41   40367.0      No
1            2     1    Male   54   45084.0      No
2            3     1    Male   42   52483.0      No
3            4     1    Male   40   40941.0      No
4            5     1    Male   46   50289.0      No
...        ...   ...     ...  ...       ...     ...
149995  149996     1    Male   48   93669.0      No
149996  149997     1    Male   25   96748.0      No
149997  149998     1    Male   26  111885.0      No
149998  149999     1    Male   25  111878.0      No
149999  150000     1  Female   37   87251.0      No

[150000 rows x 6 columns]